In [ ]:
# 라이브러리 로드 
import pandas as pd

# 데이터 파일을 데이터프레임 생성
- read_csv(파일경로)
    - 절대 경로
        - 절대적인 주소
        - 환경이 변하더라도 같은 위치를 지정
        - ex) c:/users/document/a.txt, 인터넷 url
    - 상대 경로
        - 상대적인 주소
        - 환경이 변하면 경로도 변경
        - ./ : 현재 파일의 경로
        - ../ : 현재 경로에서 상위로 이동
        - 폴더명/ : 해당하는 하위 폴더로 이동

In [ ]:
# 외부의 csv파일을 로드 
# 절대 경로
df = pd.read_csv('D:\python\csv\emp.csv')

In [ ]:
df

In [ ]:
# 상대 경로
# 상위 폴더 이동 -> csv 하위 폴더로 이동 -> emp.csv
df2 = pd.read_csv('../csv/emp.csv')

In [ ]:
df2

In [ ]:
# 상위의 일부의 데이터를 출력
# 데이터프레임명.head(n) : n의 개수에 맞춰 상위 데이터를 출력 (기본값은 5)
df2.head(2)

In [ ]:
# 하위의 일부의 데이터를 출력
# 데이터프레임명.tail(n) : n의 개수에 맞춰 하위 데이터를 출력 (기본값은 5)
df2.tail(1)

In [ ]:
# chipotle.tsv 파일을 로드 
# 상위 폴더 이동 -> csv 하위 폴더 이동 -> num_1 하위 폴더 이동 -> chipotle.tsv
# read_csv(파일의경로, sep=데이터의분할조건(기본값은 ','))
df3 = pd.read_csv('../csv/num_1/chipotle.tsv', sep='\t')

In [ ]:
df3

In [ ]:
# json파일을 로드 
# read_json(파일의경로)
# 상위 폴더 이동 -> csv 하위 폴더 이동 -> 2019 하위 폴더 이동 -> 201901_expense_list.json
json_df = pd.read_json('../csv/2019/201901_expense_list.json')

In [ ]:
json_df.head(1)

In [ ]:
# xlsx 파일을 로드 
# read_excel(파일의경로)
# 상위 폴더 이동 -> csv 하위 폴더 이동 -> 2020 하위 폴더 이동 -> 202001_expense_list.xlsx
excel_df = pd.read_excel("../csv/2020/202001_expense_list.xlsx")

In [ ]:
excel_df.tail(1)

In [ ]:
# openpyxl 라이브러리 설치
!pip install openpyxl

- loc[행의 조건식, 열의 조건식]
    - 조건식이 true인 결과를 선택
    - 행의 조건 index가 3인 데이터를 출력 loc[3]
    - 열의 조건 column이 ENAME인 데이터를 출력 loc[:, 'ENAME']
    - 행의 조건이 index가 3이고 column이 ENAME인 데이터를 출력 loc[3, 'ENAME']
- iloc[행의 위치, 열의 위치]
    - 해당하는 위치의 데이터를 출력

In [ ]:
# 데이터프레임에서 인덱스의 값이 3인 데이터를 출력
df.loc[3]

In [ ]:
# 데이터프레임에서 인덱스의 위치가 3인 데이터를 출력
df.iloc[3]

In [ ]:
# 컬럼이 'ENAME'인 데이터를 출력
df.loc[:, 'ENAME']

In [ ]:
# 두 번째에 위치한 컬럼의 데이터를 출력
df.iloc[:, 1]

In [ ]:
# SAL이 1500 초과인 데이터만 출력
# 행의 조건식 -> SAL > 1500
df.loc[df['SAL'] > 1500]

In [ ]:
df.query("SAL > 1500")

### 결측치
- value 중 데이터가 없는 값
- Nan 표시

In [ ]:
import numpy as np

In [ ]:
s1 = pd.Series([1, np.nan, 3, 4, 5])
s2 = pd.Series([1, 2, np.nan, 4, 5])
s3 = pd.Series([1, 2, 3, np.nan, 5])

In [ ]:
s1

In [59]:
# 스리즈형태의 데이터를 결합하여 데이터프레임 생성
df = pd.DataFrame({
    'S1' : s1, 
    'S2' : s2, 
    'S3' : s3
})
df

    S1   S2   S3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [ ]:
# 데이터프레임의 정보를 출력 함수
# info()
df.info()

In [ ]:
# is_() : 값이 존재하는지에 대한 bool의 형태로 출력을 해주는 함수
# isna() : 결측치를 bool의 형태로 출력을 해주는 함수(결측치인 경우 true)
df.isna()

In [ ]:
df.isna().sum()

In [ ]:
# 결측치를 제거하는 함수 
# dropna(axis = ?)
# axis 가 0(rows)이면 행을 기준으로 삭제
# axis 가 1(columns)이면 열을 기준으로 삭제

df2 = df.dropna(axis=0)

In [ ]:
# 결측치가 존재하는 행을 삭제
df.dropna(axis='rows')

In [ ]:
# 결측치가 존재하는 열을 삭제
df.dropna(axis=1)

In [ ]:
# 결측치에 값을 대입하는 함수
# fillna(n) : 결측치에 n이라는 데이터로 채워준다.

df.fillna(3)

In [ ]:
df['S1'].fillna(3)

In [ ]:
df3 = df.copy()

In [ ]:
df3

In [ ]:
df3['S1'] = df3['S1'].fillna(3)
df3

In [54]:
df4 = df

In [55]:
df4

    S1   S2   S3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [56]:
df4['S1'] = df4['S1'].fillna(3)

In [57]:
df4

    S1   S2   S3
0  1.0  1.0  1.0
1  3.0  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [58]:
df

    S1   S2   S3
0  1.0  1.0  1.0
1  3.0  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [60]:
# 통계요약 정보를 확인하는 함수
# describe()
df.describe()

             S1        S2        S3
count  4.000000  4.000000  4.000000
mean   3.250000  3.000000  2.750000
std    1.707825  1.825742  1.707825
min    1.000000  1.000000  1.000000
25%    2.500000  1.750000  1.750000
50%    3.500000  3.000000  2.500000
75%    4.250000  4.250000  3.500000
max    5.000000  5.000000  5.000000

In [61]:
df5 = df.copy()

In [62]:
# 각 컬럼별 결측치를 평균값을 대체
df5['S1'] = df5['S1'].fillna(3.25)
df5['S2'] = df5['S2'].fillna(3)
df5['S3'] = df5['S3'].fillna(2.75)

In [63]:
df5.describe()

            S1        S2       S3
count  5.00000  5.000000  5.00000
mean   3.25000  3.000000  2.75000
std    1.47902  1.581139  1.47902
min    1.00000  1.000000  1.00000
25%    3.00000  2.000000  2.00000
50%    3.25000  3.000000  2.75000
75%    4.00000  4.000000  3.00000
max    5.00000  5.000000  5.00000

In [64]:
# 컬럼의 평균값 출력
df5['S1'].mean()

3.25

In [66]:
# fillna(method=?)
# method 매개변수는 ffill, bfill
# ffill은 결측치 전의 데이터를 기준으로 값을 대체
df.fillna(method='ffill')

    S1   S2   S3
0  1.0  1.0  1.0
1  1.0  2.0  2.0
2  3.0  2.0  3.0
3  4.0  4.0  3.0
4  5.0  5.0  5.0

In [67]:
# bfill은 결측치 후의 데이터를 기준으로 값을 대체
df.fillna(method='bfill')

    S1   S2   S3
0  1.0  1.0  1.0
1  3.0  2.0  2.0
2  3.0  4.0  3.0
3  4.0  4.0  5.0
4  5.0  5.0  5.0